zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_gc/pic32ck_gc00/include/pio/pic32ck1012gc00048.h
#define PIN_PC01K_PCC_DATA0                        _UINT32_(65)
#define MUX_PC01K_PCC_DATA0                        _UINT32_(10)
#define PINMUX_PC01K_PCC_DATA0                     ((PIN_PC01K_PCC_DATA0 << 16) | MUX_PC01K_PCC_DATA0)
#define PORT_PC01K_PCC_DATA0                       (_UINT32_(1) << 1)

#define PIN_PC02K_PCC_DATA1                        _UINT32_(66)
#define MUX_PC02K_PCC_DATA1                        _UINT32_(10)
#define PINMUX_PC02K_PCC_DATA1                     ((PIN_PC02K_PCC_DATA1 << 16) | MUX_PC02K_PCC_DATA1)
#define PORT_PC02K_PCC_DATA1                       (_UINT32_(1) << 2)

#define PIN_PC03K_PCC_DATA2                        _UINT32_(67)
#define MUX_PC03K_PCC_DATA2                        _UINT32_(10)
#define PINMUX_PC03K_PCC_DATA2                     ((PIN_PC03K_PCC_DATA2 << 16) | MUX_PC03K_PCC_DATA2)
#define PORT_PC03K_PCC_DATA2                       (_UINT32_(1) << 3)

#define PIN_PC06K_PCC_DATA3                        _UINT32_(70)
#define MUX_PC06K_PCC_DATA3                        _UINT32_(10)
#define PINMUX_PC06K_PCC_DATA3                     ((PIN_PC06K_PCC_DATA3 << 16) | MUX_PC06K_PCC_DATA3)
#define PORT_PC06K_PCC_DATA3                       (_UINT32_(1) << 6)

#define PIN_PC07K_PCC_DATA4                        _UINT32_(71)
#define MUX_PC07K_PCC_DATA4                        _UINT32_(10)
#define PINMUX_PC07K_PCC_DATA4                     ((PIN_PC07K_PCC_DATA4 << 16) | MUX_PC07K_PCC_DATA4)
#define PORT_PC07K_PCC_DATA4                       (_UINT32_(1) << 7)

#define PIN_PC10K_PCC_DATA5                        _UINT32_(74)
#define MUX_PC10K_PCC_DATA5                        _UINT32_(10)
#define PINMUX_PC10K_PCC_DATA5                     ((PIN_PC10K_PCC_DATA5 << 16) | MUX_PC10K_PCC_DATA5)
#define PORT_PC10K_PCC_DATA5                       (_UINT32_(1) << 10)

#define PIN_PC11K_PCC_DATA6                        _UINT32_(75)
#define MUX_PC11K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PC11K_PCC_DATA6                     ((PIN_PC11K_PCC_DATA6 << 16) | MUX_PC11K_PCC_DATA6)
#define PORT_PC11K_PCC_DATA6                       (_UINT32_(1) << 11)

#define PIN_PC00K_PCC_DATA7                        _UINT32_(64)
#define MUX_PC00K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PC00K_PCC_DATA7                     ((PIN_PC00K_PCC_DATA7 << 16) | MUX_PC00K_PCC_DATA7)
#define PORT_PC00K_PCC_DATA7                       (_UINT32_(1) << 0)

#define PIN_PA10K_PCC_DEN1                         _UINT32_(10)
#define MUX_PA10K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PA10K_PCC_DEN1                      ((PIN_PA10K_PCC_DEN1 << 16) | MUX_PA10K_PCC_DEN1)
#define PORT_PA10K_PCC_DEN1                        (_UINT32_(1) << 10)

#define PIN_PD02K_PCC_DEN2                         _UINT32_(98)
#define MUX_PD02K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PD02K_PCC_DEN2                      ((PIN_PD02K_PCC_DEN2 << 16) | MUX_PD02K_PCC_DEN2)
#define PORT_PD02K_PCC_DEN2                        (_UINT32_(1) << 2)

/* ================== PORT definition for PDEC peripheral =================== */
#define PIN_PB04G_PDEC_QDI0                        _UINT32_(36)
#define MUX_PB04G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB04G_PDEC_QDI0                     ((PIN_PB04G_PDEC_QDI0 << 16) | MUX_PB04G_PDEC_QDI0)
#define PORT_PB04G_PDEC_QDI0                       (_UINT32_(1) << 4)

#define PIN_PB05G_PDEC_QDI1                        _UINT32_(37)
#define MUX_PB05G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PB05G_PDEC_QDI1                     ((PIN_PB05G_PDEC_QDI1 << 16) | MUX_PB05G_PDEC_QDI1)
#define PORT_PB05G_PDEC_QDI1                       (_UINT32_(1) << 5)

#define PIN_PB06G_PDEC_QDI2                        _UINT32_(38)
#define MUX_PB06G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB06G_PDEC_QDI2                     ((PIN_PB06G_PDEC_QDI2 << 16) | MUX_PB06G_PDEC_QDI2)
#define PORT_PB06G_PDEC_QDI2                       (_UINT32_(1) << 6)

/* =================== PORT definition for PTC peripheral =================== */
#define PIN_PA09N_PTC_DRV0                         _UINT32_(9) 
#define MUX_PA09N_PTC_DRV0                         _UINT32_(13)
#define PINMUX_PA09N_PTC_DRV0                      ((PIN_PA09N_PTC_DRV0 << 16) | MUX_PA09N_PTC_DRV0)
#define PORT_PA09N_PTC_DRV0                        (_UINT32_(1) << 9)

#define PIN_PA10N_PTC_DRV1                         _UINT32_(10)
#define MUX_PA10N_PTC_DRV1                         _UINT32_(13)
#define PINMUX_PA10N_PTC_DRV1                      ((PIN_PA10N_PTC_DRV1 << 16) | MUX_PA10N_PTC_DRV1)
#define PORT_PA10N_PTC_DRV1                        (_UINT32_(1) << 10)

#define PIN_PA11N_PTC_DRV2                         _UINT32_(11)
#define MUX_PA11N_PTC_DRV2                         _UINT32_(13)
#define PINMUX_PA11N_PTC_DRV2                      ((PIN_PA11N_PTC_DRV2 << 16) | MUX_PA11N_PTC_DRV2)
#define PORT_PA11N_PTC_DRV2                        (_UINT32_(1) << 11)

#define PIN_PA12N_PTC_DRV3                         _UINT32_(12)
#define MUX_PA12N_PTC_DRV3                         _UINT32_(13)
#define PINMUX_PA12N_PTC_DRV3                      ((PIN_PA12N_PTC_DRV3 << 16) | MUX_PA12N_PTC_DRV3)
#define PORT_PA12N_PTC_DRV3                        (_UINT32_(1) << 12)

#define PIN_PB00N_PTC_DRV4                         _UINT32_(32)
#define MUX_PB00N_PTC_DRV4                         _UINT32_(13)
#define PINMUX_PB00N_PTC_DRV4                      ((PIN_PB00N_PTC_DRV4 << 16) | MUX_PB00N_PTC_DRV4)
#define PORT_PB00N_PTC_DRV4                        (_UINT32_(1) << 0)

#define PIN_PB01N_PTC_DRV5                         _UINT32_(33)
#define MUX_PB01N_PTC_DRV5                         _UINT32_(13)
#define PINMUX_PB01N_PTC_DRV5                      ((PIN_PB01N_PTC_DRV5 << 16) | MUX_PB01N_PTC_DRV5)
#define PORT_PB01N_PTC_DRV5                        (_UINT32_(1) << 1)

#define PIN_PC00N_PTC_DRV10                        _UINT32_(64)
#define MUX_PC00N_PTC_DRV10                        _UINT32_(13)
#define PINMUX_PC00N_PTC_DRV10                     ((PIN_PC00N_PTC_DRV10 << 16) | MUX_PC00N_PTC_DRV10)
#define PORT_PC00N_PTC_DRV10                       (_UINT32_(1) << 0)

#define PIN_PC01N_PTC_DRV11                        _UINT32_(65)
#define MUX_PC01N_PTC_DRV11                        _UINT32_(13)
#define PINMUX_PC01N_PTC_DRV11                     ((PIN_PC01N_PTC_DRV11 << 16) | MUX_PC01N_PTC_DRV11)
#define PORT_PC01N_PTC_DRV11                       (_UINT32_(1) << 1)

